cask_args appdir: '/Applications'
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'kaos/shell'

brew 'coreutils'
brew 'zsh'
brew 'fasd'
brew 'mas'

brew 'awscli'
brew 'pv'
brew 'wget'
brew 'hub'
brew 'ag'
brew 'fswatch'

# bash
brew 'shellcheck'
brew 'bats-assert'
brew 'bats-file'

# nodejs
brew 'npm'

# golang
brew 'go', args: ['devel']

# fucking ruby
brew 'ruby-install'
brew 'rbenv'
brew 'rbenv-bundler'

# gpg
brew 'gpg2'
brew 'gpg-agent'
brew 'pinentry-mac'

# casks
cask 'aws-vault'
cask 'google-chrome'
cask 'alfred'
cask 'dash'
cask 'fantastical'
cask 'plex-media-player'
cask 'docker-beta'
cask 'dropbox'
cask '1password'
cask 'telegram'
cask 'whatsapp'

# versions
cask 'slack-beta'
cask 'sublime-text-dev'
cask 'iterm2-beta'

# fonts
cask 'font-inconsolata'
cask 'font-source-code-pro'

# app store
# mas 'Fantastical 2', id: 975937182
# mas 'Twitter', id: 409789998
mas 'Captured', id: 414675451
