cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'kaos/shell'
tap 'getantibody/tap'
tap 'homebrew/homebrew-php'

brew 'coreutils'
brew 'zsh'
brew 'mas'
brew 'antibody'
brew 'fasd'
brew 'direnv'

brew 'awscli'
brew 'pv'
brew 'wget'
brew 'hub'
brew 'ag'
brew 'fswatch'

# bash
brew 'shellcheck'
brew 'bats-assert'
brew 'bats-file'

# nodejs
brew 'npm'

# golang
brew 'go', args: ['devel']

# ruby
brew 'ruby-install'
brew 'openssl'
brew 'libyaml'
brew 'libffi'
brew 'chruby'

# php
brew 'php-version'
brew 'php55'
brew 'composer'
brew 'php-code-sniffer'

# gpg
brew 'gpg2'
brew 'gpg-agent'
brew 'pinentry-mac'

# casks
cask 'aws-vault'
cask 'google-chrome'
cask 'dash'
cask 'plex-media-player'
cask 'spectacle'
cask 'alfred'

# versions
cask 'iterm2-beta'

# fonts
cask 'font-inconsolata'
cask 'font-source-code-pro'
cask 'font-roboto-mono-for-powerline'

# app store
mas 'Captured', id: 414675451
mas 'Irvue', id: 1039633667
