cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'kaos/shell'
tap 'getantibody/tap'

brew 'coreutils'
brew 'zsh'
brew 'mas'
brew 'antibody'
brew 'fasd'
brew 'direnv'

brew 'awscli'
brew 'pv'
brew 'wget'
brew 'hub'
brew 'ag'
brew 'fswatch'
brew 'watchman'

# bash
brew 'shellcheck'
brew 'bats-assert',  args: ["ignore-dependencies"]
brew 'bats-file',  args: ["ignore-dependencies"]
brew 'shfmt'

# nodejs
brew 'npm'

# golang
brew 'go'

# ruby
brew 'ruby-install'
brew 'libyaml'
brew 'libffi'
brew 'chruby'

# gpg
brew 'gpg2'
brew 'gpg-agent'
brew 'pinentry-mac'

# casks
cask 'aws-vault'
cask 'google-chrome'
cask 'dash'
cask 'plex-media-player'
cask 'spectacle'
cask 'visual-studio-code'
cask 'postgres'
cask 'sekey'

# versions
cask 'iterm2-nightly'

# fonts
cask 'font-inconsolata'
cask 'font-source-code-pro'
cask 'font-roboto-mono-for-powerline'

