azemoh.one-monokai
bbenoist.nix
bierner.markdown-preview-github-styles
davidanson.vscode-markdownlint
dlech.chmod
editorconfig.editorconfig
github.vscode-github-actions
golang.go
hashicorp.hcl
hashicorp.terraform
mrmlnc.vscode-json5
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.makefile-tools
ms-vscode.remote-explorer
puppet.puppet-vscode
redhat.vscode-yaml
sourcegraph.amp
tamasfe.even-better-toml
timonwong.shellcheck
vscodevim.vim
ziglang.vscode-zig
